//=============================================================================
//
// メイン
// Author:髙野馨將
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include <Windows.h>
#include <tchar.h> // _T
#include <d3dx9.h>
#include <math.h>
#include <assert.h>
#include "xaudio2.h"	//サウンド処理に必要
#define _CRTDBG_MAP_ALLOC
#include <cstdlib>
#include <stdlib.h>
#include <crtdbg.h>

#ifdef _DEBUG
#define CHECK_MEM_LEAK
#endif // _DEBUG

//普段使用禁止
#ifdef CHECK_MEM_LEAK
#define DEBUG new ( _NORMAL_BLOCK , __FILE__ , __LINE__ )
#endif // CHECK_MEM_LEAK

//#pragma push_macro("new")
//#undef new
//#include <d3dx9.h>
//#pragma pop_macro("new")

//=============================================================================
// マクロ定義
//=============================================================================
#define MAX_OBJECT		(512)		//オブジェクトの最大数
#define MAX_PRIO		(5)			//優先順位の最大数

//=============================================================================
// 前方宣言
//=============================================================================
class CObject;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
int GetFPS(void);