//=============================================================================
//
// ナンバー処理
// Author:髙野馨將
//
//=============================================================================
#include "application.h"
#include "number.h"
#include "renderer.h"

//=============================================================================
//コンストラクタ
//=============================================================================
CNumber::CNumber(int nPriority) : CObject2D(nPriority)
{

}

//=============================================================================
//デストラクタ
//=============================================================================
CNumber::~CNumber()
{//何も書かない
}

//=============================================================================
//ナンバーの初期化
//=============================================================================
HRESULT CNumber::Init()
{
	//オブジェクトの初期化
	CObject2D::Init();

	//デバイスの取得
	LPDIRECT3DDEVICE9 pDevice = CApplication::GetRenderer()->GetDevice();

	//テクスチャ読み込み
	D3DXCreateTextureFromFile(pDevice,
		"data\\TEXTURE\\number000.png",
		&m_pTexture);

	//テクスチャの設定
	CObject2D::BindTexture(m_pTexture);

	//テクスチャの初期化
	SetTex(10, 0);

	return S_OK;
}

//=============================================================================
//ナンバーの生成
//=============================================================================
void CNumber::Uninit()
{
	//テクスチャの破棄
	if (m_pTexture != NULL)
	{
		m_pTexture->Release();
		m_pTexture = NULL;
	}

	//破棄処理
	Flag();
}

//=============================================================================
//ナンバーの生成
//=============================================================================
CNumber * CNumber::Create(const D3DXVECTOR3 pos, const D3DXVECTOR2 &size)
{
	CNumber *pNumber = new CNumber;

	if (pNumber != nullptr)
	{
		//初期化
		pNumber->Init();
		pNumber->SetPos(pos);
		pNumber->SetSize(D3DXVECTOR3(size.x, size.y, 0.0f));
	}

	return pNumber;
}